export const ASSET = {
    SEAC: "f735eb717f2f31dfc8d12d9df379da9b198b2045",
    SEAS: "de7be47c4c93f1483a0a3fff556a885a68413d97",
    GAS: "602c79718b16e442de58778e148d0b1084e3b2dffd5de6b7b16cee7969282de7",
    NEO: "c56f33fc6ecfcd0c225c4ab356fee59390af8560be0e930faebe74a6daff7c9b",

    ONT: "0000000000000000000000000000000000000001",
    ONG: "0000000000000000000000000000000000000002"
}


export const apiVersion = "v2";


export const MSG = {
    206: "密码错误",
    207: "余额不足",
    211: "手续费GAS不足",
    600: "节点不存在",
    601: "当前节点已绑定地址,请更新地址",
    602: "创建节点超时",
    603: "节点已创建，等待交易确认",
    604: "推荐人节点不存在",
    610: "节点正在创建，请稍候",
    611: "正在处理解锁操作，请稍侯",
    612: "正在处理提取操作，请稍候",
    613: "正在处理签到操作，请稍候",
    614: "正在处理节点激活，请稍候",
    620: "错误参数：message",
    621: "错误参数：signature",
    622: "错误参数：amount",
    623: "错误参数：days",
    624: "错误参数：referre",
    625: "错误参数：transaction",
    626: "错误参数：index或length",
    640: "签名过期失效",
    641: "禁止进行签名操作",
    642: "禁止进行解锁操作",
    643: "今日已签到",
    644: "签到失败",
    645: "解锁失败",
    646: "提取失败",
    647: "无可用UTXO",
    648: "广播交易失败",
    649: "金额太少，无法提取",
    650: "请等待上一笔提取操作到账",
}